In [124]:
import pandas as pd

In [125]:
record1 = pd.Series({'Name': 'Alice',
                     'Class': 'Physics',
                     'Score': 85}) 

record2 = pd.Series({'Name': 'Jack',
                     'Class': 'Chemistry',
                     'Score': 82})

record3 = pd.Series({'Name': 'Helen',
                     'Class': 'Biology',
                     'Score': 90})

In [126]:
df = pd.DataFrame([record1, record2, record3], index=['school1', 'school2', 'school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [127]:
students = [{'Name': 'Alice',
                'Class': 'Physics',
                'Score': 85},

            {'Name': 'Jack',
                'Class': 'Chemistry',
                'Score': 82},

             {'Name': 'Helen',
                'Class': 'Biology',
                'Score': 90}             
        ]

df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [128]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [129]:
type(df.loc['school2'])

pandas.core.series.Series

In [130]:
df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [131]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [132]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [133]:
print(df['Name'])
print(type(df['Name']))

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [134]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [135]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [136]:
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

Função "axis()" o padrão é zero mas pode mudar para 1 caso queira selecionar e descartar uma coluna

Função "inplace()" quando "True" ela realmente apaga os valores passados do Df original e não retorna uma copia

"del" deleta de uma vez.

In [139]:
copy_df = df.copy()
copy_df.drop('Class', axis=1, inplace=True)
del copy_df['Score']
copy_df

          Name
school1  Alice
school2   Jack
school1  Helen

In [138]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

Atribuir coluna:

In [151]:
import numpy as np
df['ClassRanking'] = None 
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None